[
    {
        "id" : 0,
        "title": "Telstra Telecom Suffers Data Breach Potentially Exposing Employee Information",
        "snippet": "Australia's largest telecommunications company Telstra disclosed that it was the victim of a data breach through a...",
        "body" : "Australia's largest telecommunications company Telstra disclosed that it was the victim of a data breach through a third-party, nearly two weeks after Optus reported a breach of its own.\n\"There has been no breach of Telstra's systems,\" Narelle Devine, the company's chief information security officer for the Asia Pacific region, said. \"And no customer account data was involved.\"\nIt said the breach targeted a third-party platform called Work Life NAB that's no longer actively used by the company, and that the leaked data posted on the internet concerned a \"now-obsolete Telstra employee rewards program.\"\nTelstra also noted it became aware of the breach last week, adding the information included first and last names and the email addresses used to sign up for the program. It further clarified that the data posted was from 2017.\nThe data was \"basic in nature,\" Devine said.\nThe company did not reveal how many employees were affected, but a Reuters report pegged the number at 30,000, citing internal staff email sent by Telstra.\nThe revelation comes a day after its rival Optus confirmed that nearly 2.1 million of its current and former customers suffered a leak of their personal information in the aftermath of a massive hack.\n"
    },
    {
        "id" : 1,
        "title": "Experts Warn of New RatMilad Android Spyware Targeting Enterprise Devices",
        "snippet": "A novel Android malware called RatMilad has been observed targeting a Middle Eastern enterprise mobile device by concealing itself as a VPN and phone number...",
        "body" : "A novel Android malware called RatMilad has been observed targeting a Middle Eastern enterprise mobile device by concealing itself as a VPN and phone number spoofing app.\nThe mobile trojan functions as advanced spyware with capabilities that receives and executes commands to collect and exfiltrate a wide variety of data from the infected mobile endpoint, Zimperium said in a report shared with The Hacker News.\nEvidence gathered by the mobile security company shows that the malicious app is distributed through links on social media and communication tools like Telegram, tricking unsuspecting users into sideloading the app and granting it extensive permissions.\nThe idea behind embedding the malware within a fake VPN and phone number spoofing service is also clever in that the app claims to enable users to verify social media accounts via phone, a technique popular in countries where access is restricted.\n\"Once installed and in control, the attackers could access the camera to take pictures, record video and audio, get precise GPS locations, view pictures from the device, and more,\" Zimperium researcher Nipun Gupta said.\nOther features of RatMilad make it possible for the malware to amass SIM information, clipboard data, SMS messages, call logs, contact lists, and even perform file read and write operations.\nZimperium hypothesized that the operators responsible for RatMilad acquired source code from an Iranian hacker group dubbed AppMilad and integrated it into a fraudulent app for distributing it to unwitting users.\nThe scale of the infections is unknown, but the cybersecurity company said it detected the spyware during a failed compromise attempt of a customer's enterprise device.\nA post shared on a Telegram channel used to propagate the malware sample has been viewed over 4,700 times with more than 200 external shares, indicating a limited scope.\n\"The RatMilad spyware and the Iranian-based hacker group AppMilad represent a changing environment impacting mobile device security,\" Richard Melick, director of mobile threat intelligence at Zimperium, said.\n\"From Pegasus to PhoneSpy, there is a growing mobile spyware market available through legitimate and illegitimate sources, and RatMilad is just one in the mix.\"\n"
    },
    {
        "id" : 2,
        "title": "FBI, CISA, and NSA Reveal How Hackers Targeted a Defense Industrial Base Organization",
        "snippet": "U.S. cybersecurity and intelligence agencies on Tuesday disclosed that multiple nation-state hacking groups...",
        "body" : "U.S. cybersecurity and intelligence agencies on Tuesday disclosed that multiple nation-state hacking groups potentially targeted a \"Defense Industrial Base (DIB) Sector organization's enterprise network\" as part of a cyber espionage campaign.\n\"[Advanced persistent threat] actors used an open-source toolkit called Impacket to gain their foothold within the environment and further compromise the network, and also used a custom data exfiltration tool, CovalentStealer, to steal the victim's sensitive data,\" the authorities said.\nThe joint advisory, which was authored by the Cybersecurity and Infrastructure Security Agency (CISA), the Federal Bureau of Investigation (FBI), and the National Security Agency (NSA), said the adversaries likely had long-term access to the compromised environment.\nThe findings are the result of CISA's incident response efforts in collaboration with a trusted third-party security firm from November 2021 through January 2022. It did not attribute the intrusion to a known threat actor or group.\nThe initial infection vector used to breach the network is also unknown, although some of the APT actors are said to have obtained a digital beachhead to the target's Microsoft Exchange Server as early as mid-January 2021.\nSubsequent post-exploitation activities in February entailed a mix of reconnaissance and data collection efforts, the latter of which resulted in the exfiltration of sensitive contract-related information. Also deployed during this phase was the Impacket tool to establish persistence and facilitate lateral movement.\nA month later, the APT actors exploited ProxyLogon flaws in Microsoft Exchange Server to install 17 China Chopper web shells and HyperBro, a backdoor exclusively used by a Chinese threat group called Lucky Mouse (aka APT27, Bronze Union, Budworm, or Emissary Panda).\nThe intruders, from late July through mid-October 2021, further employed a bespoke malware strain called CovalentStealer against the unnamed entity to siphon documents stored on file shares and upload them to a Microsoft OneDrive cloud folder.\nOrganizations are recommended to monitor logs for connections from unusual VPNs, suspicious account use, anomalous and known malicious command-line usage, and unauthorized changes to user accounts.\n"
    }
]